Revit 2027 API
BuiltInFailures.WallFailures.VerticalLayerExtensionFailureError Property
 Cannot extend layer(s) of the highlighted vertically compound wall.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId VerticalLayerExtensionFailureError { get; }
Public Shared ReadOnly Property VerticalLayerExtensionFailureError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ VerticalLayerExtensionFailureError {
	FailureDefinitionId^ get ();
}
static member VerticalLayerExtensionFailureError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.WallFailures Class
Autodesk.Revit.DB Namespace